espressif/arduino-esp32/boards.txt
pros2.menu.UploadSpeed.921600=921600
pros2.menu.UploadSpeed.921600.upload.speed=921600
pros2.menu.UploadSpeed.115200=115200
pros2.menu.UploadSpeed.115200.upload.speed=115200
pros2.menu.UploadSpeed.256000.windows=256000
pros2.menu.UploadSpeed.256000.upload.speed=256000
pros2.menu.UploadSpeed.230400.windows.upload.speed=256000
pros2.menu.UploadSpeed.230400=230400
pros2.menu.UploadSpeed.230400.upload.speed=230400
pros2.menu.UploadSpeed.460800.linux=460800
pros2.menu.UploadSpeed.460800.macosx=460800
pros2.menu.UploadSpeed.460800.upload.speed=460800


pros2.menu.DebugLevel.none=None
pros2.menu.DebugLevel.none.build.code_debug=0
pros2.menu.DebugLevel.error=Error
pros2.menu.DebugLevel.error.build.code_debug=1
pros2.menu.DebugLevel.warn=Warn
pros2.menu.DebugLevel.warn.build.code_debug=2
pros2.menu.DebugLevel.info=Info
pros2.menu.DebugLevel.info.build.code_debug=3
pros2.menu.DebugLevel.debug=Debug
pros2.menu.DebugLevel.debug.build.code_debug=4
pros2.menu.DebugLevel.verbose=Verbose
pros2.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

micros2.name=microS2
micros2.vid.0=0x239A
micros2.pid.0=0x80C5

micros2.upload.tool=esptool_py
micros2.upload.maximum_size=1310720
micros2.upload.maximum_data_size=327680
micros2.upload.flags=

micros2.serial.disableDTR=false
micros2.serial.disableRTS=false

micros2.build.mcu=esp32s2
micros2.build.core=esp32
micros2.build.variant=micro_s2
micros2.build.board=MICROS2

micros2.build.serial=1
micros2.build.f_cpu=240000000L
micros2.build.flash_size=16MB
micros2.build.flash_freq=80m
micros2.build.flash_mode=dio
micros2.build.boot=qio
micros2.build.partitions=fatflash
micros2.build.defines=

micros2.menu.SerialMode.cdc=USB CDC
micros2.menu.SerialMode.cdc.build.serial=1
micros2.menu.SerialMode.default=UART0
micros2.menu.SerialMode.default.build.serial=0

micros2.menu.PSRAM.enabled=Enabled
micros2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
micros2.menu.PSRAM.disabled=Disabled
micros2.menu.PSRAM.disabled.build.defines=

micros2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
micros2.menu.PartitionScheme.fatflash.build.partitions=ffat
micros2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
micros2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
micros2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
micros2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
micros2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
micros2.menu.PartitionScheme.default.build.partitions=default
micros2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
micros2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
micros2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
micros2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
micros2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
micros2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
micros2.menu.PartitionScheme.minimal.build.partitions=minimal
micros2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
micros2.menu.PartitionScheme.no_ota.build.partitions=no_ota
micros2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
micros2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
micros2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
micros2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
micros2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
micros2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
micros2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
micros2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
micros2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
micros2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
micros2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
micros2.menu.PartitionScheme.huge_app.build.partitions=huge_app
micros2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
micros2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
micros2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
micros2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

micros2.menu.CPUFreq.240=240MHz (WiFi)
micros2.menu.CPUFreq.240.build.f_cpu=240000000L
micros2.menu.CPUFreq.160=160MHz (WiFi)
micros2.menu.CPUFreq.160.build.f_cpu=160000000L
micros2.menu.CPUFreq.80=80MHz (WiFi)
micros2.menu.CPUFreq.80.build.f_cpu=80000000L
micros2.menu.CPUFreq.40=40MHz
micros2.menu.CPUFreq.40.build.f_cpu=40000000L
micros2.menu.CPUFreq.20=20MHz
micros2.menu.CPUFreq.20.build.f_cpu=20000000L
micros2.menu.CPUFreq.10=10MHz
micros2.menu.CPUFreq.10.build.f_cpu=10000000L

micros2.menu.FlashSize.16M=16MB (128Mb)
micros2.menu.FlashSize.16M.build.flash_size=16MB
micros2.menu.FlashSize.4M=4MB (32Mb)
micros2.menu.FlashSize.4M.build.flash_size=4MB
micros2.menu.FlashSize.8M=8MB (64Mb)
micros2.menu.FlashSize.8M.build.flash_size=8MB
micros2.menu.FlashSize.8M.build.partitions=default_8MB
micros2.menu.FlashSize.2M=2MB (16Mb)
micros2.menu.FlashSize.2M.build.flash_size=2MB
micros2.menu.FlashSize.2M.build.partitions=minimal

micros2.menu.UploadSpeed.921600=921600
micros2.menu.UploadSpeed.921600.upload.speed=921600
micros2.menu.UploadSpeed.115200=115200
micros2.menu.UploadSpeed.115200.upload.speed=115200
micros2.menu.UploadSpeed.256000.windows=256000
micros2.menu.UploadSpeed.256000.upload.speed=256000
micros2.menu.UploadSpeed.230400.windows.upload.speed=256000
micros2.menu.UploadSpeed.230400=230400
micros2.menu.UploadSpeed.230400.upload.speed=230400
micros2.menu.UploadSpeed.460800.linux=460800
micros2.menu.UploadSpeed.460800.macosx=460800
micros2.menu.UploadSpeed.460800.upload.speed=460800

micros2.menu.DebugLevel.none=None
micros2.menu.DebugLevel.none.build.code_debug=0
micros2.menu.DebugLevel.error=Error
micros2.menu.DebugLevel.error.build.code_debug=1
micros2.menu.DebugLevel.warn=Warn
micros2.menu.DebugLevel.warn.build.code_debug=2
micros2.menu.DebugLevel.info=Info
micros2.menu.DebugLevel.info.build.code_debug=3
micros2.menu.DebugLevel.debug=Debug
micros2.menu.DebugLevel.debug.build.code_debug=4
micros2.menu.DebugLevel.verbose=Verbose
micros2.menu.DebugLevel.verbose.build.code_debug=5

