espressif/arduino-esp32/boards.txt
##############################################################

cw02.name=XinaBox CW02

cw02.upload.tool=esptool_py
cw02.upload.maximum_size=1310720
cw02.upload.maximum_data_size=294912
cw02.upload.flags=

cw02.serial.disableDTR=true
cw02.serial.disableRTS=true

cw02.build.mcu=esp32
cw02.build.core=esp32
cw02.build.variant=xinabox
cw02.build.board=ESP32_DEV

cw02.build.f_cpu=240000000L
cw02.build.flash_size=4MB
cw02.build.flash_freq=40m
cw02.build.flash_mode=dio
cw02.build.boot=dio
cw02.build.partitions=default

cw02.menu.FlashMode.qio=QIO
cw02.menu.FlashMode.qio.build.flash_mode=dio
cw02.menu.FlashMode.qio.build.boot=qio
cw02.menu.FlashMode.dio=DIO
cw02.menu.FlashMode.dio.build.flash_mode=dio
cw02.menu.FlashMode.dio.build.boot=dio
cw02.menu.FlashMode.qout=QOUT
cw02.menu.FlashMode.qout.build.flash_mode=dout
cw02.menu.FlashMode.qout.build.boot=qout
cw02.menu.FlashMode.dout=DOUT
cw02.menu.FlashMode.dout.build.flash_mode=dout
cw02.menu.FlashMode.dout.build.boot=dout

cw02.menu.FlashFreq.80=80MHz
cw02.menu.FlashFreq.80.build.flash_freq=80m
cw02.menu.FlashFreq.40=40MHz
cw02.menu.FlashFreq.40.build.flash_freq=40m

cw02.menu.FlashSize.4M=4MB (32Mb)
cw02.menu.FlashSize.4M.build.flash_size=4MB
cw02.menu.FlashSize.2M=2MB (16Mb)
cw02.menu.FlashSize.2M.build.flash_size=2MB
cw02.menu.FlashSize.2M.build.partitions=minimal

cw02.menu.UploadSpeed.921600=921600
cw02.menu.UploadSpeed.921600.upload.speed=921600
cw02.menu.UploadSpeed.115200=115200
cw02.menu.UploadSpeed.115200.upload.speed=115200
cw02.menu.UploadSpeed.256000.windows=256000
cw02.menu.UploadSpeed.256000.upload.speed=256000
cw02.menu.UploadSpeed.230400.windows.upload.speed=256000
cw02.menu.UploadSpeed.230400=230400
cw02.menu.UploadSpeed.230400.upload.speed=230400
cw02.menu.UploadSpeed.460800.linux=460800
cw02.menu.UploadSpeed.460800.macosx=460800
cw02.menu.UploadSpeed.460800.upload.speed=460800
cw02.menu.UploadSpeed.512000.windows=512000
cw02.menu.UploadSpeed.512000.upload.speed=512000

cw02.menu.DebugLevel.none=None
cw02.menu.DebugLevel.none.build.code_debug=0
cw02.menu.DebugLevel.error=Error
cw02.menu.DebugLevel.error.build.code_debug=1
cw02.menu.DebugLevel.warn=Warn
cw02.menu.DebugLevel.warn.build.code_debug=2
cw02.menu.DebugLevel.info=Info
cw02.menu.DebugLevel.info.build.code_debug=3
cw02.menu.DebugLevel.debug=Debug
cw02.menu.DebugLevel.debug.build.code_debug=4
cw02.menu.DebugLevel.verbose=Verbose
cw02.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

esp32thing.name=SparkFun ESP32 Thing

esp32thing.upload.tool=esptool_py
esp32thing.upload.maximum_size=1310720
esp32thing.upload.maximum_data_size=327680
esp32thing.upload.flags=

esp32thing.serial.disableDTR=true
esp32thing.serial.disableRTS=true

esp32thing.build.mcu=esp32
esp32thing.build.core=esp32
esp32thing.build.variant=esp32thing
esp32thing.build.board=ESP32_THING

esp32thing.build.f_cpu=240000000L
esp32thing.build.flash_mode=dio
esp32thing.build.flash_size=4MB
esp32thing.build.boot=dio
esp32thing.build.partitions=default
esp32thing.build.defines=

esp32thing.menu.FlashFreq.80=80MHz
esp32thing.menu.FlashFreq.80.build.flash_freq=80m
esp32thing.menu.FlashFreq.40=40MHz
esp32thing.menu.FlashFreq.40.build.flash_freq=40m

esp32thing.menu.PartitionScheme.default=Default
esp32thing.menu.PartitionScheme.default.build.partitions=default
esp32thing.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32thing.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32thing.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32thing.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32thing.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32thing.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

esp32thing.menu.UploadSpeed.921600=921600
esp32thing.menu.UploadSpeed.921600.upload.speed=921600
esp32thing.menu.UploadSpeed.115200=115200
esp32thing.menu.UploadSpeed.115200.upload.speed=115200
esp32thing.menu.UploadSpeed.256000.windows=256000
esp32thing.menu.UploadSpeed.256000.upload.speed=256000
esp32thing.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32thing.menu.UploadSpeed.230400=230400
esp32thing.menu.UploadSpeed.230400.upload.speed=230400
esp32thing.menu.UploadSpeed.460800.linux=460800
esp32thing.menu.UploadSpeed.460800.macosx=460800
esp32thing.menu.UploadSpeed.460800.upload.speed=460800
esp32thing.menu.UploadSpeed.512000.windows=512000
esp32thing.menu.UploadSpeed.512000.upload.speed=512000

esp32thing.menu.DebugLevel.none=None
esp32thing.menu.DebugLevel.none.build.code_debug=0
esp32thing.menu.DebugLevel.error=Error
esp32thing.menu.DebugLevel.error.build.code_debug=1
esp32thing.menu.DebugLevel.warn=Warn
esp32thing.menu.DebugLevel.warn.build.code_debug=2
esp32thing.menu.DebugLevel.info=Info
esp32thing.menu.DebugLevel.info.build.code_debug=3
esp32thing.menu.DebugLevel.debug=Debug
esp32thing.menu.DebugLevel.debug.build.code_debug=4
esp32thing.menu.DebugLevel.verbose=Verbose
esp32thing.menu.DebugLevel.verbose.build.code_debug=5


##############################################################

nina_w10.name=u-blox NINA-W10 series (ESP32)

nina_w10.upload.tool=esptool_py
nina_w10.upload.maximum_size=1310720
nina_w10.upload.maximum_data_size=327680
nina_w10.upload.flags=

nina_w10.serial.disableDTR=true
nina_w10.serial.disableRTS=true

nina_w10.build.mcu=esp32
nina_w10.build.core=esp32
nina_w10.build.variant=nina_w10
nina_w10.build.board=UBLOX_NINA_W10
nina_w10.build.f_cpu=240000000L
nina_w10.build.boot=dio
nina_w10.build.partitions=minimal
nina_w10.build.flash_mode=dio
nina_w10.build.flash_size=2MB
nina_w10.build.flash_freq=40m
nina_w10.build.defines=

nina_w10.menu.UploadSpeed.921600=921600
nina_w10.menu.UploadSpeed.921600.upload.speed=921600
nina_w10.menu.UploadSpeed.115200=115200
nina_w10.menu.UploadSpeed.115200.upload.speed=115200
nina_w10.menu.UploadSpeed.256000.windows=256000
nina_w10.menu.UploadSpeed.256000.upload.speed=256000
nina_w10.menu.UploadSpeed.230400.windows.upload.speed=256000
nina_w10.menu.UploadSpeed.230400=230400
nina_w10.menu.UploadSpeed.230400.upload.speed=230400
nina_w10.menu.UploadSpeed.460800.linux=460800
nina_w10.menu.UploadSpeed.460800.macosx=460800
nina_w10.menu.UploadSpeed.460800.upload.speed=460800
nina_w10.menu.UploadSpeed.512000.windows=512000
nina_w10.menu.UploadSpeed.512000.upload.speed=512000

