espressif/arduino-esp32/boards.txt
##############################################################

d1_mini32.name=WEMOS D1 MINI ESP32

d1_mini32.upload.tool=esptool_py
d1_mini32.upload.maximum_size=1310720
d1_mini32.upload.maximum_data_size=327680
d1_mini32.upload.flags=

d1_mini32.serial.disableDTR=true
d1_mini32.serial.disableRTS=true

d1_mini32.build.mcu=esp32
d1_mini32.build.core=esp32
d1_mini32.build.variant=d1_mini32
d1_mini32.build.board=D1_MINI32

d1_mini32.build.f_cpu=240000000L
d1_mini32.build.flash_mode=dio
d1_mini32.build.flash_size=4MB
d1_mini32.build.boot=dio
d1_mini32.build.partitions=default
d1_mini32.build.defines=

d1_mini32.menu.FlashFreq.80=80MHz
d1_mini32.menu.FlashFreq.80.build.flash_freq=80m
d1_mini32.menu.FlashFreq.40=40MHz
d1_mini32.menu.FlashFreq.40.build.flash_freq=40m

d1_mini32.menu.PartitionScheme.default=Default
d1_mini32.menu.PartitionScheme.default.build.partitions=default
d1_mini32.menu.PartitionScheme.no_ota=No OTA (Large APP)
d1_mini32.menu.PartitionScheme.no_ota.build.partitions=no_ota
d1_mini32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d1_mini32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
d1_mini32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d1_mini32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

d1_mini32.menu.CPUFreq.240=240MHz (WiFi/BT)
d1_mini32.menu.CPUFreq.240.build.f_cpu=240000000L
d1_mini32.menu.CPUFreq.160=160MHz (WiFi/BT)
d1_mini32.menu.CPUFreq.160.build.f_cpu=160000000L
d1_mini32.menu.CPUFreq.80=80MHz (WiFi/BT)
d1_mini32.menu.CPUFreq.80.build.f_cpu=80000000L
d1_mini32.menu.CPUFreq.40=40MHz (40MHz XTAL)
d1_mini32.menu.CPUFreq.40.build.f_cpu=40000000L
d1_mini32.menu.CPUFreq.26=26MHz (26MHz XTAL)
d1_mini32.menu.CPUFreq.26.build.f_cpu=26000000L
d1_mini32.menu.CPUFreq.20=20MHz (40MHz XTAL)
d1_mini32.menu.CPUFreq.20.build.f_cpu=20000000L
d1_mini32.menu.CPUFreq.13=13MHz (26MHz XTAL)
d1_mini32.menu.CPUFreq.13.build.f_cpu=13000000L
d1_mini32.menu.CPUFreq.10=10MHz (40MHz XTAL)
d1_mini32.menu.CPUFreq.10.build.f_cpu=10000000L

d1_mini32.menu.UploadSpeed.921600=921600
d1_mini32.menu.UploadSpeed.921600.upload.speed=921600
d1_mini32.menu.UploadSpeed.115200=115200
d1_mini32.menu.UploadSpeed.115200.upload.speed=115200
d1_mini32.menu.UploadSpeed.256000.windows=256000
d1_mini32.menu.UploadSpeed.256000.upload.speed=256000
d1_mini32.menu.UploadSpeed.230400.windows.upload.speed=256000
d1_mini32.menu.UploadSpeed.230400=230400
d1_mini32.menu.UploadSpeed.230400.upload.speed=230400
d1_mini32.menu.UploadSpeed.460800.linux=460800
d1_mini32.menu.UploadSpeed.460800.macosx=460800
d1_mini32.menu.UploadSpeed.460800.upload.speed=460800
d1_mini32.menu.UploadSpeed.512000.windows=512000
d1_mini32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

gpy.name=Pycom GPy

gpy.upload.tool=esptool_py
gpy.upload.maximum_size=1310720
gpy.upload.maximum_data_size=327680
gpy.upload.flags=

gpy.serial.disableDTR=true
gpy.serial.disableRTS=true

gpy.build.mcu=esp32
gpy.build.core=esp32
gpy.build.variant=gpy
gpy.build.board=PYCOM_GPY

gpy.build.f_cpu=240000000L
gpy.build.flash_mode=dio
gpy.build.flash_size=8MB
gpy.build.boot=dio
gpy.build.partitions=default

gpy.menu.FlashFreq.80=80MHz
gpy.menu.FlashFreq.80.build.flash_freq=80m
gpy.menu.FlashFreq.40=40MHz
gpy.menu.FlashFreq.40.build.flash_freq=40m

gpy.menu.UploadSpeed.921600=921600
gpy.menu.UploadSpeed.921600.upload.speed=921600
gpy.menu.UploadSpeed.115200=115200
gpy.menu.UploadSpeed.115200.upload.speed=115200
gpy.menu.UploadSpeed.256000.windows=256000
gpy.menu.UploadSpeed.256000.upload.speed=256000
gpy.menu.UploadSpeed.230400.windows.upload.speed=256000
gpy.menu.UploadSpeed.230400=230400
gpy.menu.UploadSpeed.230400.upload.speed=230400
gpy.menu.UploadSpeed.460800.linux=460800
gpy.menu.UploadSpeed.460800.macosx=460800
gpy.menu.UploadSpeed.460800.upload.speed=460800
gpy.menu.UploadSpeed.512000.windows=512000
gpy.menu.UploadSpeed.512000.upload.speed=512000

gpy.menu.DebugLevel.none=None
gpy.menu.DebugLevel.none.build.code_debug=0
gpy.menu.DebugLevel.error=Error
gpy.menu.DebugLevel.error.build.code_debug=1
gpy.menu.DebugLevel.warn=Warn
gpy.menu.DebugLevel.warn.build.code_debug=2
gpy.menu.DebugLevel.info=Info
gpy.menu.DebugLevel.info.build.code_debug=3
gpy.menu.DebugLevel.debug=Debug
gpy.menu.DebugLevel.debug.build.code_debug=4
gpy.menu.DebugLevel.verbose=Verbose
gpy.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

vintlabs-devkit-v1.name=VintLabs ESP32 Devkit

vintlabs-devkit-v1.upload.tool=esptool_py
vintlabs-devkit-v1.upload.maximum_size=1310720
vintlabs-devkit-v1.upload.maximum_data_size=327680
vintlabs-devkit-v1.upload.flags=

vintlabs-devkit-v1.serial.disableDTR=true
vintlabs-devkit-v1.serial.disableRTS=true

vintlabs-devkit-v1.build.mcu=esp32
vintlabs-devkit-v1.build.core=esp32
vintlabs-devkit-v1.build.variant=vintlabsdevkitv1
vintlabs-devkit-v1.build.board=ESP32_DEV

vintlabs-devkit-v1.build.f_cpu=240000000L
vintlabs-devkit-v1.build.flash_mode=dio
vintlabs-devkit-v1.build.flash_size=4MB
vintlabs-devkit-v1.build.boot=dio
vintlabs-devkit-v1.build.partitions=default
vintlabs-devkit-v1.build.defines=

vintlabs-devkit-v1.menu.FlashFreq.80=80MHz
vintlabs-devkit-v1.menu.FlashFreq.80.build.flash_freq=80m
vintlabs-devkit-v1.menu.FlashFreq.40=40MHz
vintlabs-devkit-v1.menu.FlashFreq.40.build.flash_freq=40m

vintlabs-devkit-v1.menu.UploadSpeed.2000000=2000000
vintlabs-devkit-v1.menu.UploadSpeed.2000000.upload.speed=2000000
vintlabs-devkit-v1.menu.UploadSpeed.921600=921600
vintlabs-devkit-v1.menu.UploadSpeed.921600.upload.speed=921600
vintlabs-devkit-v1.menu.UploadSpeed.115200=115200
vintlabs-devkit-v1.menu.UploadSpeed.115200.upload.speed=115200
vintlabs-devkit-v1.menu.UploadSpeed.256000.windows=256000
vintlabs-devkit-v1.menu.UploadSpeed.256000.upload.speed=256000
vintlabs-devkit-v1.menu.UploadSpeed.230400.windows.upload.speed=256000
vintlabs-devkit-v1.menu.UploadSpeed.230400=230400
vintlabs-devkit-v1.menu.UploadSpeed.230400.upload.speed=230400
vintlabs-devkit-v1.menu.UploadSpeed.460800.linux=460800
vintlabs-devkit-v1.menu.UploadSpeed.460800.macosx=460800
vintlabs-devkit-v1.menu.UploadSpeed.460800.upload.speed=460800
vintlabs-devkit-v1.menu.UploadSpeed.512000.windows=512000
vintlabs-devkit-v1.menu.UploadSpeed.512000.upload.speed=512000

vintlabs-devkit-v1.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.default.build.partitions=default
vintlabs-devkit-v1.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
vintlabs-devkit-v1.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
vintlabs-devkit-v1.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
vintlabs-devkit-v1.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
vintlabs-devkit-v1.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.minimal.build.partitions=minimal
vintlabs-devkit-v1.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.no_ota.build.partitions=no_ota
vintlabs-devkit-v1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
vintlabs-devkit-v1.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
vintlabs-devkit-v1.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
vintlabs-devkit-v1.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
vintlabs-devkit-v1.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
vintlabs-devkit-v1.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
vintlabs-devkit-v1.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
vintlabs-devkit-v1.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.huge_app.build.partitions=huge_app
vintlabs-devkit-v1.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
vintlabs-devkit-v1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
vintlabs-devkit-v1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
vintlabs-devkit-v1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
vintlabs-devkit-v1.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
vintlabs-devkit-v1.menu.PartitionScheme.fatflash.build.partitions=ffat
vintlabs-devkit-v1.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
vintlabs-devkit-v1.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
vintlabs-devkit-v1.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
vintlabs-devkit-v1.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

